In [48]:
import pandas as pd
import requests
from datetime import datetime

In [53]:
get_denuncias = requests.get("http://3.23.96.142:8080/denuncia")

df = pd.DataFrame(get_denuncias.json())
df = df.drop(columns=['link','mediaType'])
df

,identifier,nome,dataEnchente,local,relato,idade,mmChovido,previsao,dataDenuncia
0,1,maraba,2023-06-06,Imperador,não,20,0.0,0.0,2023-06-07
1,2,maraba,2023-06-05,Imperador,não,20,0.0,0.0,2023-06-07
2,3,leonardo,2023-06-05,Mina,não,23,0.0,0.0,2023-06-07

In [51]:
getMonth = lambda d: d.month

df['dataEnchente'] = pd.to_datetime((df['dataEnchente']),format='%Y-%m-%d')
df['dataDenuncia'] = pd.to_datetime((df['dataDenuncia']),format='%Y-%m-%d')

df['mesEnchente'] = df['dataEnchente'].apply(getMonth)
df['mesDenuncia'] = df['dataDenuncia'].apply(getMonth)

df

,identifier,nome,dataEnchente,local,relato,idade,mmChovido,previsao,dataDenuncia,mesEnchente,mesDenuncia
0,1,maraba,2023-06-06,Imperador,não,20,0.0,0.0,2023-06-07,6,6
1,2,maraba,2023-06-05,Imperador,não,20,0.0,0.0,2023-06-07,6,6

In [7]:
df = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/gapminder_unfiltered.csv')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
3308     Zimbabwe    Africa  1987   62.351   9216418  706.157306
3309     Zimbabwe    Africa  1992   60.377  10704340  693.420786
3310     Zimbabwe    Africa  1997   46.809  11404948  792.449960
3311     Zimbabwe    Africa  2002   39.989  11926563  672.038623
3312     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[3313 rows x 6 columns]

In [10]:
def toInt(l):
    return int(l)

In [11]:
df['lifeInt'] = df['lifeExp'].apply(toInt)
df

          country continent  year  lifeExp       pop   gdpPercap  lifeInt
0     Afghanistan      Asia  1952   28.801   8425333  779.445314       28
1     Afghanistan      Asia  1957   30.332   9240934  820.853030       30
2     Afghanistan      Asia  1962   31.997  10267083  853.100710       31
3     Afghanistan      Asia  1967   34.020  11537966  836.197138       34
4     Afghanistan      Asia  1972   36.088  13079460  739.981106       36
...           ...       ...   ...      ...       ...         ...      ...
3308     Zimbabwe    Africa  1987   62.351   9216418  706.157306       62
3309     Zimbabwe    Africa  1992   60.377  10704340  693.420786       60
3310     Zimbabwe    Africa  1997   46.809  11404948  792.449960       46
3311     Zimbabwe    Africa  2002   39.989  11926563  672.038623       39
3312     Zimbabwe    Africa  2007   43.487  12311143  469.709298       43

[3313 rows x 7 columns]